<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of inSyncClient and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.pliancy.pkg.DruvaInSyncClient</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Druva inSync</string>
		<key>NAME</key>
		<string>DruvaInSyncClient</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.pliancy.download.DruvaInSyncClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pathname%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
	</array>
</dict>
</plist>